Moddable-OpenSource/moddable/modules/network/ble/nrf52/modBLEClient.c
static void clearScanned(modBLE ble);

static modBLE gBLE = NULL;

NRF_BLE_SCAN_DEF(m_scan);	// device scanning module

void xs_ble_client_initialize(xsMachine *the)
{
	modBLEPlatformInitializeDataRecord init;
	ble_conn_params_init_t *p_cp_init;
    ret_code_t err_code;

	if (NULL != gBLE)
		xsUnknownError("BLE already initialized");
	gBLE = (modBLE)c_calloc(sizeof(modBLERecord), 1);
	if (!gBLE)
		xsUnknownError("no memory");
	gBLE->the = the;
	gBLE->obj = xsThis;
	gBLE->iocap = 0xFF;
	gBLE->duplicates = true;
	xsRemember(gBLE->obj);
	
	// Initialize platform Bluetooth modules
	init.p_gatt = &gBLE->m_gatt;
	init.pm_event_handler = pm_evt_handler;
	init.vs_uuid_count = vendor_specific_uuid_count;
	p_cp_init = &init.cp_init;
	c_memset(p_cp_init, 0, sizeof(ble_conn_params_init_t));
	p_cp_init->first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
	p_cp_init->next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
	p_cp_init->max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
	
	err_code = modBLEPlatformInitialize(&init);
	
	// Initialize default scan params - required when connecting without first scanning
	if (NRF_SUCCESS == err_code) {
		ble_gap_scan_params_t *scan_params = &gBLE->scan_params;
		nrf_ble_scan_init_t *scan_init = &gBLE->scan_init;

		scan_init->p_scan_param = scan_params;
		scan_params->active = 1;
		scan_params->filter_policy = BLE_GAP_SCAN_FP_ACCEPT_ALL;
		scan_params->interval = 0x50;
		scan_params->window = 0x30;

		err_code = nrf_ble_scan_init(&m_scan, scan_init, NULL);
	}
	
	if (NRF_SUCCESS != err_code)
		xsUnknownError("ble initialization failed");

    // Register a handler for GAP and GATTC events
	NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);

	// Notify app that stack is ready
	modMessagePostToMachine(the, NULL, 0, bleClientReadyEvent, NULL);
}

void xs_ble_client_close(xsMachine *the)
{
	modBLE ble = xsmcGetHostData(xsThis);
	if (!ble) return;

	gBLE = NULL;
	xsForget(ble->obj);
	xsmcSetHostData(xsThis, NULL);
	modMessagePostToMachine(ble->the, NULL, 0, bleClientCloseEvent, ble);
}

void xs_ble_client_destructor(void *data)
{
	modBLE ble = data;
	if (!ble) return;
	
	modBLEConnection connections = ble->connections, next;
	while (connections != NULL) {
		modBLEConnection connection = connections;
		connections = connections->next;
		c_free(connection);
	}
	
	clearScanned(ble);

	c_free(ble);
	gBLE = NULL;

	nrf_sdh_disable_request();
}

void xs_ble_client_set_local_privacy(xsMachine *the)
{
}

void xs_ble_client_start_scanning(xsMachine *the)
{
	ret_code_t err_code;
	uint8_t active = xsmcToBoolean(xsArg(0));
	uint8_t duplicates = xsmcToBoolean(xsArg(1));
	uint32_t interval = xsmcToInteger(xsArg(2));
	uint32_t window = xsmcToInteger(xsArg(3));
	uint16_t filterPolicy = xsmcToInteger(xsArg(4));
	ble_gap_scan_params_t *scan_params = &gBLE->scan_params;
	nrf_ble_scan_init_t *scan_init = &gBLE->scan_init;

	switch(filterPolicy) {
		case kBLEScanFilterPolicyWhitelist:
			filterPolicy = BLE_GAP_SCAN_FP_WHITELIST;
			break;
		case kBLEScanFilterNotResolvedDirected:
			filterPolicy = BLE_GAP_SCAN_FP_ALL_NOT_RESOLVED_DIRECTED;
			break;
		case kBLEScanFilterWhitelistNotResolvedDirected:
			filterPolicy = BLE_GAP_SCAN_FP_WHITELIST_NOT_RESOLVED_DIRECTED;
			break;
		default:
			filterPolicy = BLE_GAP_SCAN_FP_ACCEPT_ALL;
			break;
	}

	gBLE->duplicates = duplicates;

	c_memset(scan_params, 0, sizeof(ble_gap_scan_params_t));
	scan_params->active = active;
	scan_params->filter_policy = filterPolicy;
	scan_params->interval = interval;
	scan_params->window = window;

    c_memset(scan_init, 0, sizeof(scan_init));
    scan_init->p_scan_param = scan_params;

    err_code = nrf_ble_scan_init(&m_scan, scan_init, scan_evt_handler);
    if (NRF_SUCCESS == err_code)
    	err_code = nrf_ble_scan_start(&m_scan);
	if (NRF_SUCCESS != err_code)
		xsUnknownError("ble start scan failed");
}

void xs_ble_client_stop_scanning(xsMachine *the)
{
	nrf_ble_scan_stop();
	clearScanned(gBLE);
}

void xs_ble_client_connect(xsMachine *the)
{
	uint16_t argc = xsmcArgc;
	uint8_t *address = (uint8_t*)xsmcToArrayBuffer(xsArg(0));
	uint8_t addressType = xsmcToInteger(xsArg(1));
	
	ble_gap_addr_t addr;
	ret_code_t err_code;

	addr.addr_id_peer = 0;
	addr.addr_type = addressType;
	c_memmove(&addr.addr, address, BLE_GAP_ADDR_LEN);
		
	// Ignore duplicate connection attempts
	if (modBLEConnectionFindByAddress(&addr)) {
		LOG_GATTC_MSG("Ignoring duplicate connect attempt");
		return;
	};
	
	// Add a new connection record to be filled as the connection completes
	modBLEConnection connection = c_calloc(sizeof(modBLEConnectionRecord), 1);
	if (!connection)
		xsUnknownError("out of memory");
	connection->conn_handle = BLE_CONN_HANDLE_INVALID;
	connection->addr = addr;
	modBLEConnectionAdd(connection);
	
	err_code = sd_ble_gap_connect(&addr, &m_scan.scan_params, &m_scan.conn_params, APP_BLE_CONN_CFG_TAG);
	
	// The third argument is an existing connection handle, when available.
	// This can happen when the server establishes a connection that gets passed to the client.
	// When there is an existing connection handle, post the gapConnectedEvent so this client can populate the connection record and notify the application.
	if (NRF_SUCCESS == err_code && argc > 2) {
		ble_gap_evt_t gap_evt;
		gap_evt.conn_handle = xsmcToInteger(xsArg(2));
		gap_evt.params.connected.peer_addr = addr;
		modMessagePostToMachine(the, (uint8_t*)&gap_evt, sizeof(ble_gap_evt_t), gapConnectedEvent, NULL);
	}
}

void xs_ble_client_set_security_parameters(xsMachine *the)
{
	uint8_t encryption = xsmcToBoolean(xsArg(0));
	uint8_t bonding = xsmcToBoolean(xsArg(1));
	uint8_t mitm = xsmcToBoolean(xsArg(2));
	uint8_t iocap = xsmcToInteger(xsArg(3));
	uint16_t err;
	
	gBLE->encryption = encryption;
	gBLE->bonding = bonding;
	gBLE->mitm = mitm;
	gBLE->iocap = iocap;

#if (NRF_BLE_LESC_ENABLED == 1)
	if (mitm && (iocap == DisplayYesNo))
		modLog("# warning: LE secure connections require a Nordic SDK patch. Refer to the Moddable nRF52 README.md for details.");
#endif

	err = modBLESetSecurityParameters(encryption, bonding, mitm, iocap);
	if (NRF_SUCCESS != err)
		xsUnknownError("invalid security params");
		
