Moddable-OpenSource/moddable/modules/network/ble/nrf52/modBLEClient.c
	xsBeginHost(gBLE->the);
	xsmcVars(2);
	xsVar(0) = xsmcNewObject();
	xsmcSetBoolean(xsVar(1), gBLE->encryption);
	xsmcSet(xsVar(0), xsID_encryption, xsVar(1));
	xsmcSetBoolean(xsVar(1), gBLE->bonding);
	xsmcSet(xsVar(0), xsID_bonding, xsVar(1));
	xsmcSetBoolean(xsVar(1), gBLE->mitm);
	xsmcSet(xsVar(0), xsID_mitm, xsVar(1));
	xsCall2(gBLE->obj, xsID_callback, xsString("onSecurityParameters"), xsVar(0));
	xsEndHost(gBLE->the);
}

void xs_ble_client_passkey_reply(xsMachine *the)
{
	uint8_t *address = (uint8_t*)xsmcToArrayBuffer(xsArg(0));
	uint32_t digits = xsmcToInteger(xsArg(1));
	char passkey[7];
	
	modBLEConnection connection = modBLEConnectionFindByAddressBytes(address);
	if (!connection)
		xsUnknownError("connection not found");

	itoa(digits, passkey, 10);
	sd_ble_gap_auth_key_reply(connection->conn_handle, BLE_GAP_AUTH_KEY_TYPE_PASSKEY, passkey);
}

void xs_gap_connection_initialize(xsMachine *the)
{
	uint8_t conn_id;
	xsmcVars(1);	// xsArg(0) is client
	xsmcGet(xsVar(0), xsArg(0), xsID_connection);
	conn_id = xsmcToInteger(xsVar(0));
	modBLEConnection connection = modBLEConnectionFindByConnectionID(conn_id);
	if (!connection)
		xsUnknownError("connection not found");
	connection->the = the;
	connection->objConnection = xsThis;
	connection->objClient = xsArg(0);
}
	
void xs_gap_connection_disconnect(xsMachine *the)
{
	uint8_t conn_handle = xsmcToInteger(xsArg(0));
	sd_ble_gap_disconnect(conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
}

void xs_gap_connection_read_rssi(xsMachine *the)
{
	uint8_t conn_handle = xsmcToInteger(xsArg(0));
	sd_ble_gap_rssi_start(conn_handle, 0, 0);
}

void xs_gap_connection_exchange_mtu(xsMachine *the)
{
	uint16_t conn_handle = xsmcToInteger(xsArg(0));
	uint16_t mtu = xsmcToInteger(xsArg(1));
	modBLEConnection connection = modBLEConnectionFindByConnectionID(conn_handle);
	if (!connection) return;
	
	connection->mtu_exchange_pending = 1;
	sd_ble_gattc_exchange_mtu_request(conn_handle, mtu);
}

void xs_gatt_client_discover_primary_services(xsMachine *the)
{
	uint8_t conn_handle = xsmcToInteger(xsArg(0));
	uint16_t argc = xsmcArgc;

	modBLEConnection connection = modBLEConnectionFindByConnectionID(conn_handle);
	if (!connection) return;
	c_memset(&connection->gattProcedure, 0, sizeof(gattProcedureRecord));
	if (argc > 1)
		bufferToUUID(&connection->gattProcedure.searchUUID, (uint8_t*)xsmcToArrayBuffer(xsArg(1)), xsmcGetArrayBufferLength(xsArg(1)));
	else
		connection->gattProcedure.searchUUID.uuid = 0;
	connection->gattProcedure.obj = xsThis;
	
	sd_ble_gattc_primary_services_discover(conn_handle, 1, (argc > 1 ? &connection->gattProcedure.searchUUID : NULL));
}

void xs_gatt_service_discover_characteristics(xsMachine *the)
{
	uint16_t argc = xsmcArgc;
	uint8_t conn_handle = xsmcToInteger(xsArg(0));

	modBLEConnection connection = modBLEConnectionFindByConnectionID(conn_handle);
	if (!connection) return;
	
	c_memset(&connection->gattProcedure, 0, sizeof(gattProcedureRecord));
	connection->gattProcedure.handle_range.start_handle = xsmcToInteger(xsArg(1));
	connection->gattProcedure.handle_range.end_handle = xsmcToInteger(xsArg(2));
	connection->gattProcedure.obj = xsThis;
	if (argc > 3) {
		bufferToUUID(&connection->gattProcedure.searchUUID, (uint8_t*)xsmcToArrayBuffer(xsArg(3)), xsmcGetArrayBufferLength(xsArg(3)));
	}
	else
		connection->gattProcedure.searchUUID.uuid = 0;
		
	sd_ble_gattc_characteristics_discover(conn_handle, &connection->gattProcedure.handle_range);
}

void xs_gatt_characteristic_discover_all_characteristic_descriptors(xsMachine *the)
{
	uint8_t conn_handle = xsmcToInteger(xsArg(0));
	uint16_t characteristic = xsmcToInteger(xsArg(1));
	ble_uuid_t uuid;
	uint16_t start, end;

	modBLEConnection connection = modBLEConnectionFindByConnectionID(conn_handle);
	if (!connection) return;
	
	// Discover all service characteristics to find the range of characteristic handles for searching descriptors
	c_memset(&connection->gattProcedure, 0, sizeof(gattProcedureRecord));
	connection->gattProcedure.searchUUID.uuid = 0;
	connection->gattProcedure.obj = xsThis;
	connection->gattProcedure.discovery_handle = characteristic;

	xsmcVars(2);
	xsmcGet(xsVar(0), xsThis, xsID_service);
	xsmcGet(xsVar(1), xsVar(0), xsID_start);
	start = xsmcToInteger(xsVar(1));
	xsmcGet(xsVar(1), xsVar(0), xsID_end);
	end = xsmcToInteger(xsVar(1));
	connection->gattProcedure.handle_range.start_handle = start;
	connection->gattProcedure.handle_range.end_handle = end;
	sd_ble_gattc_characteristics_discover(conn_handle, &connection->gattProcedure.handle_range);
}

void xs_gatt_characteristic_read_value(xsMachine *the)
{
	uint8_t conn_handle = xsmcToInteger(xsArg(0));
	uint16_t handle = xsmcToInteger(xsArg(1));
	ret_code_t err_code;
#if 0
	uint16_t auth = 0;
	uint16_t argc = xsmcArgc;
	if (argc > 2)
		auth = xsmcToInteger(xsArg(2));
#endif
	modBLEConnection connection = modBLEConnectionFindByConnectionID(conn_handle);
	if (!connection) return;
	
	c_memset(&connection->gattProcedure, 0, sizeof(gattProcedureRecord));
	connection->gattProcedure.id = CHARACTERISTIC_READ_VALUE;
	
	sd_ble_gattc_read(connection->conn_handle, handle, 0);
}

static void writeAttribute(uint16_t conn_handle, uint16_t attribute, uint8_t write_op, uint8_t *data, uint16_t len)
{
	ble_gattc_write_params_t write_params;
	write_params.write_op = write_op;
	write_params.handle = attribute;
	write_params.flags = 0;
	write_params.offset = 0;
	write_params.len = len;
	write_params.p_value = data;

	sd_ble_gattc_write(conn_handle, &write_params);
}

void xs_gatt_characteristic_enable_notifications(xsMachine *the)
{
	uint8_t conn_handle = xsmcToInteger(xsArg(0));
	uint16_t characteristic = xsmcToInteger(xsArg(1));
    uint8_t data[2] = {0x01, 0x00};

	modBLEConnection connection = modBLEConnectionFindByConnectionID(conn_handle);
	if (!connection) return;

	writeAttribute(conn_handle, characteristic + 1, BLE_GATT_OP_WRITE_CMD, data, 2);
}

void xs_gatt_characteristic_disable_notifications(xsMachine *the)
{
	uint8_t conn_handle = xsmcToInteger(xsArg(0));
	uint16_t characteristic = xsmcToInteger(xsArg(1));
    uint8_t data[2] = {0x00, 0x00};

	modBLEConnection connection = modBLEConnectionFindByConnectionID(conn_handle);
	if (!connection) return;

	writeAttribute(conn_handle, characteristic + 1, BLE_GATT_OP_WRITE_CMD, data, 2);
}

void xs_gatt_descriptor_write_value(xsMachine *the)
{
	uint16_t argc = xsmcArgc;
	uint8_t conn_handle = xsmcToInteger(xsArg(0));
	uint16_t handle = xsmcToInteger(xsArg(1));
	uint8_t needResponse = 0;
	uint8_t *data;
	uint16_t len;

	modBLEConnection connection = modBLEConnectionFindByConnectionID(conn_handle);
	if (!connection) return;

