Moddable-OpenSource/moddable/modules/network/ble/nrf52/modBLEClient.c
	if (argc > 3)
		needResponse = xsmcToInteger(xsArg(3));

	switch (xsmcTypeOf(xsArg(2))) {
		case xsStringType:
			data = xsmcToString(xsArg(2));
			len = c_strlen(data);
			break;
		case xsReferenceType:
			if (xsmcIsInstanceOf(xsArg(2), xsArrayBufferPrototype)) {
				data = xsmcToArrayBuffer(xsArg(2));
				len = xsmcGetArrayBufferLength(xsArg(2));
			}
			else
				goto unknown;
			break;
		unknown:
		default:
			xsUnknownError("unsupported type");
			break;
	}

	c_memset(&connection->gattProcedure, 0, sizeof(gattProcedureRecord));
	connection->gattProcedure.id = DESCRIPTOR_WRITE_VALUE;
	
	writeAttribute(conn_handle, handle, needResponse ? BLE_GATT_OP_WRITE_REQ : BLE_GATT_OP_WRITE_CMD, data, len);
}

void xs_gatt_characteristic_write_without_response(xsMachine *the)
{
	uint8_t conn_handle = xsmcToInteger(xsArg(0));
	uint16_t handle = xsmcToInteger(xsArg(1));
	uint8_t *data;
	uint16_t len;

	modBLEConnection connection = modBLEConnectionFindByConnectionID(conn_handle);
	if (!connection) return;

	switch (xsmcTypeOf(xsArg(2))) {
		case xsStringType:
			data = xsmcToString(xsArg(2));
			len = c_strlen(data);
			break;
		case xsReferenceType:
			if (xsmcIsInstanceOf(xsArg(2), xsArrayBufferPrototype)) {
				data = xsmcToArrayBuffer(xsArg(2));
				len = xsmcGetArrayBufferLength(xsArg(2));
			}
			else
				goto unknown;
			break;
		unknown:
		default:
			xsUnknownError("unsupported type");
			break;
	}

	c_memset(&connection->gattProcedure, 0, sizeof(gattProcedureRecord));
	connection->gattProcedure.id = CHARACTERISTIC_WRITE_WITHOUT_RESPONSE;

	writeAttribute(conn_handle, handle, BLE_GATT_OP_WRITE_CMD, data, len);
}

void xs_gatt_descriptor_read_value(xsMachine *the)
{
	uint16_t conn_handle = xsmcToInteger(xsArg(0));
	uint16_t handle = xsmcToInteger(xsArg(1));
#if 0
	uint16_t auth = 0;
	uint16_t argc = xsmcArgc;
	if (argc > 2)
		auth = xsmcToInteger(xsArg(2));
#endif
	modBLEConnection connection = modBLEConnectionFindByConnectionID(conn_handle);
	if (!connection) return;
	
	c_memset(&connection->gattProcedure, 0, sizeof(gattProcedureRecord));
	connection->gattProcedure.id = DESCRIPTOR_READ_VALUE;

	sd_ble_gattc_read(conn_handle, handle, 0);
}

modBLEConnection modBLEConnectionFindByConnectionID(uint16_t conn_handle)
{
	modBLEConnection walker;
	for (walker = gBLE->connections; NULL != walker; walker = walker->next)
		if (conn_handle == walker->conn_handle)
			break;
	return walker;
}

modBLEConnection modBLEConnectionFindByAddress(ble_gap_addr_t *addr)
{
	modBLEConnection walker;
	for (walker = gBLE->connections; NULL != walker; walker = walker->next)
		if (0 == c_memcmp(addr, (uint8_t*)&walker->addr, sizeof(ble_gap_addr_t)))
			break;
	return walker;
}

modBLEConnection modBLEConnectionFindByAddressBytes(uint8_t *addr)
{
	modBLEConnection walker;
	for (walker = gBLE->connections; NULL != walker; walker = walker->next)
		if (0 == c_memcmp(addr, (uint8_t*)&walker->addr.addr, BLE_GAP_ADDR_LEN))
			break;
	return walker;
}

void modBLEConnectionAdd(modBLEConnection connection)
{
	if (!gBLE->connections)
		gBLE->connections = connection;
	else {
		modBLEConnection walker;
		for (walker = gBLE->connections; walker->next; walker = walker->next)
			;
		walker->next = connection;
	}
}

void modBLEConnectionRemove(modBLEConnection connection)
{
	modBLEConnection walker, prev = NULL;
	for (walker = gBLE->connections; NULL != walker; prev = walker, walker = walker->next) {
		if (connection == walker) {
			if (NULL == prev)
				gBLE->connections = walker->next;
			else
				prev->next = walker->next;
			c_free(connection);
			break;
		}
	}
}

int modBLEConnectionSaveAttHandle(modBLEConnection connection, ble_uuid_t *uuid, uint16_t handle)
{
	int result = -1;
	for (int service_index = 0; service_index < service_count; ++service_index) {
		for (int att_index = 0; att_index < attribute_counts[service_index]; ++att_index) {
			const gatts_attr_db_t *att_db = &gatt_db[service_index][att_index];
			const attr_desc_t *att_desc = &att_db->att_desc;
			ble_uuid_t att_desc_uuid;
			bufferToUUID(&att_desc_uuid, att_desc->uuid_p, att_desc->uuid_length);
			if (BLE_UUID_EQ(&att_desc_uuid, uuid)) {
				for (int k = 0; k < char_name_count; ++k) {
					const char_name_table *char_name = &char_names[k];
					if (service_index == char_name->service_index && att_index == char_name->att_index) {
						connection->handles[k] = handle;
						result = k;
						goto bail;
					}
				}
			}
		}
	}
bail:
	return result;
}

static void clearScanned(modBLE ble)
{
	modBLEScannedPacket walker = ble->scanned;
	while (walker) {
		modBLEScannedPacket next = walker->next;
		c_free(walker);
		walker = next;
	}
	ble->scanned = NULL;
}

void bleClientReadyEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength)
{
	if (!gBLE) return;
	
	for (int service_index = 0; service_index < service_count; ++service_index) {
		const gatts_attr_db_t *att_db = &gatt_db[service_index][0];
		const attr_desc_t *att_desc = &att_db->att_desc;
		
		// register vendor specific 128-bit uuids
		if (UUID_LEN_128 == att_desc->length) {
			uint8_t uuid_type;
			ble_uuid128_t ble_uuid_128;
			ble_uuid_128 = *(ble_uuid128_t*)att_desc->value;
			sd_ble_uuid_vs_add(&ble_uuid_128, &uuid_type);
		}
	}

	xsBeginHost(the);
	xsCall1(gBLE->obj, xsID_callback, xsString("onReady"));
	xsEndHost(the);
}

void bleClientCloseEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength)
{
	modBLE ble = refcon;
	xs_ble_client_destructor(ble);
}

void gapConnectedEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength)
{
	if (!gBLE) return;

	ble_gap_evt_t *gap_evt = (ble_gap_evt_t*)message;
	ble_gap_evt_connected_t const * p_evt_connected = (ble_gap_evt_connected_t const *)&gap_evt->params.connected;
	uint16_t conn_handle = gap_evt->conn_handle;
	
	xsBeginHost(gBLE->the);
	
	modBLEConnection connection = modBLEConnectionFindByAddress((ble_gap_addr_t*)&p_evt_connected->peer_addr);
	if (!connection)
		xsUnknownError("connection not found");
		
	if (BLE_CONN_HANDLE_INVALID != connection->conn_handle)
		goto bail;
		
