Moddable-OpenSource/moddable/modules/network/ble/nrf52/modBLEClient.c
	connection->conn_handle = conn_handle;

	xsmcVars(2);
	xsVar(0) = xsmcNewObject();
	xsmcSetInteger(xsVar(1), conn_handle);
	xsmcSet(xsVar(0), xsID_connection, xsVar(1));
	xsmcSetArrayBuffer(xsVar(1), (uint8_t*)&p_evt_connected->peer_addr.addr[0], BLE_GAP_ADDR_LEN);
	xsmcSet(xsVar(0), xsID_address, xsVar(1));
	xsCall2(gBLE->obj, xsID_callback, xsString("onConnected"), xsVar(0));

bail:
	xsEndHost(gBLE->the);
}

void gapDisconnectedEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength)
{
	if (!gBLE) return;

	ble_gap_evt_t *gap_evt = (ble_gap_evt_t*)message;
	ble_gap_evt_disconnected_t const * p_evt_disconnected = (ble_gap_evt_disconnected_t const *)&gap_evt->params.disconnected;
	uint16_t conn_handle = gap_evt->conn_handle;

	xsBeginHost(gBLE->the);
	modBLEConnection connection = modBLEConnectionFindByConnectionID(conn_handle);
	
	// ignore multiple disconnects on same connection
	if (!connection) {
		LOG_GATTC_MSG("Ignoring duplicate disconnect event");
		goto bail;
	}	
	
	xsmcVars(1);
	xsmcSetInteger(xsVar(0), conn_handle);
	xsCall2(connection->objConnection, xsID_callback, xsString("onDisconnected"), xsVar(0));
	modBLEConnectionRemove(connection);

bail:
	xsEndHost(gBLE->the);
}

void gapAdvReportEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength)
{
	ble_gap_evt_adv_report_t const * p_evt_adv_report = (ble_gap_evt_adv_report_t const *)message;

	if (!gBLE) return;
	
	xsBeginHost(gBLE->the);
	xsmcVars(2);
	
	if (!gBLE->duplicates) {
		uint16_t type =
			(p_evt_adv_report->type.connectable   << 0) |
			(p_evt_adv_report->type.scannable     << 1) |
			(p_evt_adv_report->type.directed      << 2) |
			(p_evt_adv_report->type.scan_response << 3) |
			(p_evt_adv_report->type.extended_pdu  << 4) |
			(p_evt_adv_report->type.status        << 5) |
			(p_evt_adv_report->type.reserved      << 7);
			
		modBLEScannedPacket scanned = gBLE->scanned;
		while (scanned) {
			if (type == scanned->type && 0 == c_memcmp(p_evt_adv_report->peer_addr.addr, scanned->addr, 6))
				goto bail;
			scanned = scanned->next;
		}
		modBLEScannedPacket address = c_calloc(1, sizeof(modBLEScannedPacketRecord));
		if (!address)
			xsUnknownError("out of memory");
		address->type = type;
		c_memmove(address->addr, p_evt_adv_report->peer_addr.addr, 6);
		if (!gBLE->scanned)
			gBLE->scanned = address;
		else {
			modBLEScannedPacket walker;
			for (walker = gBLE->scanned; walker->next; walker = walker->next)
				;
			walker->next = address;
		}
	}

	xsVar(0) = xsmcNewObject();
	xsmcSetArrayBuffer(xsVar(1), p_evt_adv_report->data.p_data, p_evt_adv_report->data.len);
	xsmcSet(xsVar(0), xsID_scanResponse, xsVar(1));
	xsmcSetArrayBuffer(xsVar(1), (void*)&p_evt_adv_report->peer_addr.addr[0], BLE_GAP_ADDR_LEN);
	xsmcSet(xsVar(0), xsID_address, xsVar(1));
	xsmcSetInteger(xsVar(1), p_evt_adv_report->peer_addr.addr_type);
	xsmcSet(xsVar(0), xsID_addressType, xsVar(1));
	xsmcSetInteger(xsVar(1), p_evt_adv_report->rssi);
	xsmcSet(xsVar(0), xsID_rssi, xsVar(1));
	xsCall2(gBLE->obj, xsID_callback, xsString("onDiscovered"), xsVar(0));
	
bail:
	xsEndHost(gBLE->the);
}

void gapAuthKeyRequestEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength)
{
	if (!gBLE) return;

	ble_gap_evt_t *gap_evt = (ble_gap_evt_t*)message;
	ble_gap_evt_auth_key_request_t const * p_evt_auth_key_request = (ble_gap_evt_auth_key_request_t const *)&gap_evt->params.auth_key_request;
	uint16_t conn_handle = gap_evt->conn_handle;

	xsBeginHost(gBLE->the);
	modBLEConnection connection = modBLEConnectionFindByConnectionID(conn_handle);
	if (!connection)
		xsUnknownError("connection not found");
	xsmcVars(2);
	xsVar(0) = xsmcNewObject();
	xsmcSetArrayBuffer(xsVar(1), connection->addr.addr, BLE_GAP_ADDR_LEN);
	xsmcSet(xsVar(0), xsID_address, xsVar(1));
	xsCall2(gBLE->obj, xsID_callback, xsString("onPasskeyInput"), xsVar(0));
	xsEndHost(gBLE->the);
}

void gapPasskeyDisplayEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength)
{
	if (!gBLE) return;

	ble_gap_evt_t *gap_evt = (ble_gap_evt_t*)message;
	ble_gap_evt_passkey_display_t const * p_evt_passkey_display = (ble_gap_evt_passkey_display_t const *)&gap_evt->params.passkey_display;
	uint16_t conn_handle = gap_evt->conn_handle;

	xsBeginHost(gBLE->the);
	modBLEConnection connection = modBLEConnectionFindByConnectionID(conn_handle);
	if (!connection)
		xsUnknownError("connection not found");
	xsmcVars(2);
	xsVar(0) = xsmcNewObject();
	xsmcSetArrayBuffer(xsVar(1), connection->addr.addr, BLE_GAP_ADDR_LEN);
	xsmcSet(xsVar(0), xsID_address, xsVar(1));
	xsmcSetInteger(xsVar(1), atoi(p_evt_passkey_display->passkey));
	xsmcSet(xsVar(0), xsID_passkey, xsVar(1));
	xsCall2(gBLE->obj, xsID_callback, xsString(p_evt_passkey_display->match_request ? "onPasskeyConfirm" : "onPasskeyDisplay"), xsVar(0));
	xsEndHost(gBLE->the);
}

void gapRSSIChangedEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength)
{
	if (!gBLE) return;

	ble_gap_evt_t *gap_evt = (ble_gap_evt_t*)message;
	ble_gap_evt_rssi_changed_t const * p_evt_rssi_changed = &gap_evt->params.rssi_changed;
	uint16_t conn_handle = gap_evt->conn_handle;

	xsBeginHost(gBLE->the);
	modBLEConnection connection = modBLEConnectionFindByConnectionID(conn_handle);
	if (!connection)
		xsUnknownError("connection not found");
	xsCall2(connection->objConnection, xsID_callback, xsString("onRSSI"), xsInteger(p_evt_rssi_changed->rssi));
	xsEndHost(gBLE->the);
}

static void pmConnSecSucceededEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength)
{
	if (!gBLE) return;

	pm_evt_t *pm_evt = (pm_evt_t*)message;
	pm_conn_secured_evt_t const * conn_sec_succeeded = (pm_conn_secured_evt_t const *)&pm_evt->params.conn_sec_succeeded;
	uint16_t conn_handle = pm_evt->conn_handle;

	xsBeginHost(gBLE->the);
	modBLEConnection connection = modBLEConnectionFindByConnectionID(conn_handle);
	if (!connection)
		xsUnknownError("connection not found");
	xsCall1(gBLE->obj, xsID_callback, xsString("onAuthenticated"));
	xsEndHost(gBLE->the);
}

void gattcServiceDiscoveryEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength)
{
	ret_code_t err_code;
	gattDiscoveryRecord *gdr;
	uint16_t end_handle = 0;

	gdr = (gattDiscoveryRecord *)refcon;
	ble_gattc_evt_prim_srvc_disc_rsp_t *prim_srvc_disc_rsp = (ble_gattc_evt_prim_srvc_disc_rsp_t *)gdr->rsp;
	uint16_t conn_handle = gdr->conn_handle;

