Moddable-OpenSource/moddable/modules/network/ble/nrf52/modBLEClient.c
	if (!gBLE) {
		c_free(gdr);
		return;
	}
	
	xsBeginHost(gBLE->the);
	modBLEConnection connection = modBLEConnectionFindByConnectionID(conn_handle);
	if (!connection)
		xsUnknownError("connection not found");

	if (BLE_GATT_STATUS_SUCCESS != gdr->gatt_status) {
		xsCall1(connection->gattProcedure.obj, xsID_callback, xsString("onService"));
		goto bail;
	}
	xsmcVars(2);
	for (uint16_t i = 0; i < prim_srvc_disc_rsp->count; ++i) {
		uint8_t buffer[UUID_LEN_128];
		uint16_t length;
		ble_gattc_service_t const *service = &prim_srvc_disc_rsp->services[i];
		
		// @@ Likely 128-bit UUID - TBD
		if (BLE_UUID_TYPE_UNKNOWN == service->uuid.type) {
			if (service->handle_range.end_handle > end_handle)
				end_handle = service->handle_range.end_handle;
			continue;
		}
		
		uuidToBuffer(buffer, (ble_uuid_t *)&service->uuid, &length);
		if (0 != length) {
			xsVar(0) = xsmcNewObject();
			xsmcSetArrayBuffer(xsVar(1), buffer, length);
			xsmcSet(xsVar(0), xsID_uuid, xsVar(1));
			xsmcSetInteger(xsVar(1), service->handle_range.start_handle);
			xsmcSet(xsVar(0), xsID_start, xsVar(1));
			xsmcSetInteger(xsVar(1), service->handle_range.end_handle);
			xsmcSet(xsVar(0), xsID_end, xsVar(1));
			xsCall2(connection->objClient, xsID_callback, xsString("onService"), xsVar(0));
			if (service->handle_range.end_handle > end_handle)
				end_handle = service->handle_range.end_handle;
		}
	}
	if (connection->gattProcedure.searchUUID.uuid != 0 || 65535 == end_handle) {
		xsCall1(connection->gattProcedure.obj, xsID_callback, xsString("onService"));
	}
	else {
		err_code = sd_ble_gattc_primary_services_discover(connection->conn_handle, end_handle + 1, NULL);
		if (NRF_SUCCESS != err_code) {
			xsCall1(connection->gattProcedure.obj, xsID_callback, xsString("onService"));
		}
	}
bail:
	c_free(gdr);
	xsEndHost(gBLE->the);
}

void gattcCharacteristicDiscoveryEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength)
{
	ret_code_t err_code;
	gattDiscoveryRecord *gdr;
	uint16_t end_handle = 0;

	gdr = (gattDiscoveryRecord *)refcon;
	ble_gattc_evt_char_disc_rsp_t *char_disc_rsp = (ble_gattc_evt_char_disc_rsp_t *)gdr->rsp;
	uint16_t conn_handle = gdr->conn_handle;
	
	if (!gBLE) {
		c_free(gdr);
		return;
	}
	
	xsBeginHost(gBLE->the);
	modBLEConnection connection = modBLEConnectionFindByConnectionID(conn_handle);
	if (!connection)
		xsUnknownError("connection not found");
    
	if (BLE_GATT_STATUS_SUCCESS != gdr->gatt_status) {
		xsCall1(connection->gattProcedure.obj, xsID_callback, xsString("onCharacteristic"));
		goto bail;
	}

	xsmcVars(2);
	
	for (uint16_t i = 0; i < char_disc_rsp->count; ++i) {
		uint8_t buffer[UUID_LEN_128];
		uint16_t length;
		ble_gattc_char_t const *characteristic = &char_disc_rsp->chars[i];
		
		// @@ Likely 128-bit UUID - TBD
		if (BLE_UUID_TYPE_UNKNOWN == characteristic->uuid.type) {
			if (characteristic->handle_value > end_handle);
				end_handle = characteristic->handle_value;
			continue;
		}

		uuidToBuffer(buffer, (ble_uuid_t *)&characteristic->uuid, &length);
		if ((connection->gattProcedure.searchUUID.uuid != 0) && BLE_UUID_NEQ(&connection->gattProcedure.searchUUID, &characteristic->uuid)) {
			if (characteristic->handle_value > end_handle);
				end_handle = characteristic->handle_value;
			continue;
		}
			
		int index = modBLEConnectionSaveAttHandle(connection, (ble_uuid_t *)&characteristic->uuid, characteristic->handle_value);
		xsVar(0) = xsmcNewObject();
		xsmcSetArrayBuffer(xsVar(1), buffer, length);
		xsmcSet(xsVar(0), xsID_uuid, xsVar(1));
		xsmcSetInteger(xsVar(1), characteristic->handle_value);
		xsmcSet(xsVar(0), xsID_handle, xsVar(1));

		uint8_t properties = 0;
		if (characteristic->char_props.read)
			properties |= GATT_CHAR_PROP_BIT_READ;
		if (characteristic->char_props.write_wo_resp)
			properties |= GATT_CHAR_PROP_BIT_WRITE_NR;
		if (characteristic->char_props.write)
			properties |= GATT_CHAR_PROP_BIT_WRITE;
		if (characteristic->char_props.notify)
			properties |= GATT_CHAR_PROP_BIT_NOTIFY;
		if (characteristic->char_props.indicate)
			properties |= GATT_CHAR_PROP_BIT_INDICATE;
		xsmcSetInteger(xsVar(1), properties);
		xsmcSet(xsVar(0), xsID_properties, xsVar(1));
		
		if (-1 != index) {
			xsmcSetString(xsVar(1), (char*)char_names[index].name);
			xsmcSet(xsVar(0), xsID_name, xsVar(1));
			xsmcSetString(xsVar(1), (char*)char_names[index].type);
			xsmcSet(xsVar(0), xsID_type, xsVar(1));
		}
		xsCall2(connection->gattProcedure.obj, xsID_callback, xsString("onCharacteristic"), xsVar(0));
		
		if (connection->gattProcedure.searchUUID.uuid != 0) {
			xsCall1(connection->gattProcedure.obj, xsID_callback, xsString("onCharacteristic"));
			goto bail;
		}
		if (characteristic->handle_value > end_handle);
			end_handle = characteristic->handle_value;
	}

	connection->gattProcedure.handle_range.start_handle = end_handle + 1;
	err_code = sd_ble_gattc_characteristics_discover(connection->conn_handle, &connection->gattProcedure.handle_range);
	if (NRF_SUCCESS != err_code)
		xsCall1(connection->gattProcedure.obj, xsID_callback, xsString("onCharacteristic"));
		
bail:
	c_free(gdr);
	xsEndHost(gBLE->the);
}

void gattcCharacteristicsForDescriptorsDiscoveryEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength)
{
	ret_code_t err_code;
	gattDiscoveryRecord *gdr;
	uint16_t end_handle = 0;

	gdr = (gattDiscoveryRecord *)refcon;
	ble_gattc_evt_char_disc_rsp_t *char_disc_rsp = (ble_gattc_evt_char_disc_rsp_t *)gdr->rsp;
	uint16_t conn_handle = gdr->conn_handle;
	
	if (!gBLE) {
		c_free(gdr);
		return;
	}
	
	xsBeginHost(gBLE->the);
	modBLEConnection connection = modBLEConnectionFindByConnectionID(conn_handle);
	if (!connection)
		xsUnknownError("connection not found");
    
	if (BLE_GATT_STATUS_SUCCESS != gdr->gatt_status) {
		goto bail;
	}

	xsmcVars(2);
	
	for (uint16_t i = 0; i < char_disc_rsp->count; ++i) {
		uint8_t buffer[UUID_LEN_128];
		uint16_t length;
		ble_gattc_char_t const *characteristic = &char_disc_rsp->chars[i];
		
		// @@ Likely 128-bit UUID - TBD
		if (BLE_UUID_TYPE_UNKNOWN == characteristic->uuid.type) {
			if (characteristic->handle_value > end_handle);
				end_handle = characteristic->handle_value;
			continue;
		}

