Moddable-OpenSource/moddable/modules/network/ble/nrf52/modBLEClient.c
		if (connection->gattProcedure.discovery_handle < characteristic->handle_value) {
			connection->gattProcedure.handle_range.start_handle = connection->gattProcedure.discovery_handle + 1;
			connection->gattProcedure.handle_range.end_handle = characteristic->handle_decl - 1;
			connection->gattProcedure.discovery_handle = 0;
			sd_ble_gattc_descriptors_discover(conn_handle, &connection->gattProcedure.handle_range);
			goto bail;
		}
		if (characteristic->handle_value > end_handle);
			end_handle = characteristic->handle_value;
	}
	connection->gattProcedure.handle_range.start_handle = end_handle + 1;
	sd_ble_gattc_characteristics_discover(connection->conn_handle, &connection->gattProcedure.handle_range);

bail:
	c_free(gdr);
	xsEndHost(gBLE->the);
}

void gattcDescriptorDiscoveryEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength)
{
	ret_code_t err_code;
	gattDiscoveryRecord *gdr;
	uint16_t end_handle = 0;

	gdr = (gattDiscoveryRecord *)refcon;
	ble_gattc_evt_desc_disc_rsp_t *desc_disc_rsp = (ble_gattc_evt_desc_disc_rsp_t *)gdr->rsp;
	uint16_t conn_handle = gdr->conn_handle;
	
	if (!gBLE) {
		c_free(gdr);
		return;
	}
	
	xsBeginHost(gBLE->the);
	modBLEConnection connection = modBLEConnectionFindByConnectionID(conn_handle);
	if (!connection)
		xsUnknownError("connection not found");
    
	if (BLE_GATT_STATUS_SUCCESS != gdr->gatt_status) {
		xsCall1(connection->gattProcedure.obj, xsID_callback, xsString("onDescriptor"));
		goto bail;
	}

	xsmcVars(2);
		
	for (uint16_t i = 0; i < desc_disc_rsp->count; ++i) {
		uint8_t buffer[UUID_LEN_128];
		uint16_t length;
		ble_gattc_desc_t const *descriptor = &desc_disc_rsp->descs[i];
		
		// @@ Likely 128-bit UUID - TBD
		if (BLE_UUID_TYPE_UNKNOWN == descriptor->uuid.type) {
			end_handle = descriptor->handle;
			continue;
		}
		// Don't report CCCDs
		else if (0x2902 == descriptor->uuid.uuid) {
			end_handle = descriptor->handle;
			continue;
		}

		uuidToBuffer(buffer, (ble_uuid_t *)&descriptor->uuid, &length);
			
		int index = modBLEConnectionSaveAttHandle(connection, (ble_uuid_t *)&descriptor->uuid, descriptor->handle);
		xsVar(0) = xsmcNewObject();
		xsmcSetArrayBuffer(xsVar(1), buffer, length);
		xsmcSet(xsVar(0), xsID_uuid, xsVar(1));
		xsmcSetInteger(xsVar(1), descriptor->handle);
		xsmcSet(xsVar(0), xsID_handle, xsVar(1));
		
		if (-1 != index) {
			xsmcSetString(xsVar(1), (char*)char_names[index].name);
			xsmcSet(xsVar(0), xsID_name, xsVar(1));
			xsmcSetString(xsVar(1), (char*)char_names[index].type);
			xsmcSet(xsVar(0), xsID_type, xsVar(1));
		}
		xsCall2(connection->gattProcedure.obj, xsID_callback, xsString("onDescriptor"), xsVar(0));
		
		end_handle = descriptor->handle;
	}
	
	connection->gattProcedure.handle_range.start_handle = end_handle + 1;
	err_code = sd_ble_gattc_descriptors_discover(conn_handle, &connection->gattProcedure.handle_range);
	if (NRF_SUCCESS != err_code)
		xsCall1(connection->gattProcedure.obj, xsID_callback, xsString("onDescriptor"));
bail:
	c_free(gdr);
	xsEndHost(gBLE->the);
}

void gattcCharacteristicReadEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength)
{
	if (!gBLE) return;
	
	ble_gattc_evt_read_rsp_t const *read_rsp = (ble_gattc_evt_read_rsp_t const *)message;
	uint32_t conn_handle = (uint32_t)refcon;

	xsBeginHost(gBLE->the);
	modBLEConnection connection = modBLEConnectionFindByConnectionID(conn_handle);
	if (!connection)
		xsUnknownError("connection not found");
	
	xsmcVars(2);
	xsVar(0) = xsmcNewObject();
	xsmcSetArrayBuffer(xsVar(1), (void*)read_rsp->data, read_rsp->len);
	xsmcSet(xsVar(0), xsID_value, xsVar(1));
	xsmcSetInteger(xsVar(1), read_rsp->handle);
	xsmcSet(xsVar(0), xsID_handle, xsVar(1));
	
	xsCall2(connection->objClient, xsID_callback, xsString(connection->gattProcedure.id == CHARACTERISTIC_READ_VALUE ? "onCharacteristicValue" : "onDescriptorValue"), xsVar(0));
	
	xsEndHost(gBLE->the);
}

static void gattcCharacteristicNotificationEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength)
{
	if (!gBLE) return;
	
	ble_gattc_evt_hvx_t const *hvx = (ble_gattc_evt_hvx_t const *)message;
	uint32_t conn_handle = (uint32_t)refcon;
	
	xsBeginHost(gBLE->the);
	modBLEConnection connection = modBLEConnectionFindByConnectionID(conn_handle);
	if (!connection)
		xsUnknownError("connection not found");
	
	xsmcVars(2);
	xsVar(0) = xsmcNewObject();
	xsmcSetArrayBuffer(xsVar(1), (void*)hvx->data, hvx->len);
	xsmcSet(xsVar(0), xsID_value, xsVar(1));
	xsmcSetInteger(xsVar(1), hvx->handle);
	xsmcSet(xsVar(0), xsID_handle, xsVar(1));
	xsCall2(connection->objClient, xsID_callback, xsString("onCharacteristicNotification"), xsVar(0));

	xsEndHost(gBLE->the);
}

static void gattcCharacteristicWriteEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength)
{
	if (!gBLE) return;
	
	ble_gattc_evt_write_rsp_t const *write_rsp = (ble_gattc_evt_write_rsp_t const *)message;
	uint32_t conn_handle = (uint32_t)refcon;

	xsBeginHost(gBLE->the);
	modBLEConnection connection = modBLEConnectionFindByConnectionID(conn_handle);
	if (!connection)
		xsUnknownError("connection not found");
		
	xsmcVars(2);
	xsVar(0) = xsmcNewObject();
	xsmcSetInteger(xsVar(1), write_rsp->handle);
	xsmcSet(xsVar(0), xsID_handle, xsVar(1));
	xsCall2(connection->objClient, xsID_callback, xsString("onDescriptorWritten"), xsVar(0));
bail:
	xsEndHost(gBLE->the);
}

static void gattcMTUExchangedEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength)
{
	if (!gBLE) return;
	
	ble_gattc_evt_exchange_mtu_rsp_t const *mtu = (ble_gattc_evt_exchange_mtu_rsp_t const *)message;
	uint32_t conn_handle = (uint32_t)refcon;

	modBLEConnection connection = modBLEConnectionFindByConnectionID(conn_handle);
	if (!connection || !connection->mtu_exchange_pending) return;
	
	connection->mtu_exchange_pending = 0;
	xsBeginHost(gBLE->the);
	xsCall2(connection->objConnection, xsID_callback, xsString("onMTUExchanged"), xsInteger(mtu->server_rx_mtu));
	xsEndHost(gBLE->the);
}

static void logGAPEvent(uint16_t evt_id) {
	switch(evt_id) {
		case BLE_GAP_EVT_CONNECTED: modLog("BLE_GAP_EVT_CONNECTED"); break;
		case BLE_GAP_EVT_DISCONNECTED: modLog("BLE_GAP_EVT_DISCONNECTED"); break;
		case BLE_GAP_EVT_CONN_PARAM_UPDATE: modLog("BLE_GAP_EVT_CONN_PARAM_UPDATE"); break;
		case BLE_GAP_EVT_SEC_PARAMS_REQUEST: modLog("BLE_GAP_EVT_SEC_PARAMS_REQUEST"); break;
		case BLE_GAP_EVT_SEC_INFO_REQUEST: modLog("BLE_GAP_EVT_SEC_INFO_REQUEST"); break;
		case BLE_GAP_EVT_PASSKEY_DISPLAY: modLog("BLE_GAP_EVT_PASSKEY_DISPLAY"); break;
		case BLE_GAP_EVT_KEY_PRESSED: modLog("BLE_GAP_EVT_KEY_PRESSED"); break;
		case BLE_GAP_EVT_AUTH_KEY_REQUEST: modLog("BLE_GAP_EVT_AUTH_KEY_REQUEST"); break;
		case BLE_GAP_EVT_LESC_DHKEY_REQUEST: modLog("BLE_GAP_EVT_LESC_DHKEY_REQUEST"); break;
		case BLE_GAP_EVT_AUTH_STATUS: modLog("BLE_GAP_EVT_AUTH_STATUS"); break;
		case BLE_GAP_EVT_CONN_SEC_UPDATE: modLog("BLE_GAP_EVT_CONN_SEC_UPDATE"); break;
		case BLE_GAP_EVT_TIMEOUT: modLog("BLE_GAP_EVT_TIMEOUT"); break;
		case BLE_GAP_EVT_RSSI_CHANGED: modLog("BLE_GAP_EVT_RSSI_CHANGED"); break;
		case BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST: modLog("BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST"); break;
		case BLE_GAP_EVT_SCAN_REQ_REPORT: modLog("BLE_GAP_EVT_SCAN_REQ_REPORT"); break;
		case BLE_GAP_EVT_PHY_UPDATE_REQUEST: modLog("BLE_GAP_EVT_PHY_UPDATE_REQUEST"); break;
		case BLE_GAP_EVT_PHY_UPDATE: modLog("BLE_GAP_EVT_PHY_UPDATE"); break;
		case BLE_GAP_EVT_DATA_LENGTH_UPDATE_REQUEST: modLog("BLE_GAP_EVT_DATA_LENGTH_UPDATE_REQUEST"); break;
		case BLE_GAP_EVT_DATA_LENGTH_UPDATE: modLog("BLE_GAP_EVT_DATA_LENGTH_UPDATE"); break;
		case BLE_GAP_EVT_QOS_CHANNEL_SURVEY_REPORT: modLog("BLE_GAP_EVT_QOS_CHANNEL_SURVEY_REPORT"); break;
		case BLE_GAP_EVT_ADV_REPORT: modLog("BLE_GAP_EVT_ADV_REPORT"); break;
		case BLE_GAP_EVT_ADV_SET_TERMINATED: modLog("BLE_GAP_EVT_ADV_SET_TERMINATED"); break;

        case BLE_GATTC_EVT_PRIM_SRVC_DISC_RSP: modLog("BLE_GATTC_EVT_PRIM_SRVC_DISC_RSP"); break;
        case BLE_GATTC_EVT_REL_DISC_RSP: modLog("BLE_GATTC_EVT_REL_DISC_RSP"); break;
        case BLE_GATTC_EVT_CHAR_DISC_RSP: modLog("BLE_GATTC_EVT_CHAR_DISC_RSP"); break;
        case BLE_GATTC_EVT_DESC_DISC_RSP: modLog("BLE_GATTC_EVT_DESC_DISC_RSP"); break;
        case BLE_GATTC_EVT_ATTR_INFO_DISC_RSP: modLog("BLE_GATTC_EVT_ATTR_INFO_DISC_RSP"); break;
        case BLE_GATTC_EVT_CHAR_VAL_BY_UUID_READ_RSP: modLog("BLE_GATTC_EVT_CHAR_VAL_BY_UUID_READ_RSP"); break;
        case BLE_GATTC_EVT_READ_RSP: modLog("BLE_GATTC_EVT_READ_RSP"); break;
        case BLE_GATTC_EVT_CHAR_VALS_READ_RSP: modLog("BLE_GATTC_EVT_CHAR_VALS_READ_RSP"); break;
        case BLE_GATTC_EVT_WRITE_RSP: modLog("BLE_GATTC_EVT_WRITE_RSP"); break;
        case BLE_GATTC_EVT_HVX: modLog("BLE_GATTC_EVT_HVX"); break;
        case BLE_GATTC_EVT_EXCHANGE_MTU_RSP: modLog("BLE_GATTC_EVT_EXCHANGE_MTU_RSP"); break;
        case BLE_GATTC_EVT_TIMEOUT: modLog("BLE_GATTC_EVT_TIMEOUT"); break;
        case BLE_GATTC_EVT_WRITE_CMD_TX_COMPLETE: modLog("BLE_GATTC_EVT_WRITE_CMD_TX_COMPLETE"); break;
	}
}

void ble_evt_handler(const ble_evt_t *p_ble_evt, void * p_context)
{
    uint32_t err_code;

	if (!gBLE) return;
	
	LOG_GAP_EVENT(p_ble_evt->header.evt_id);
	
    switch (p_ble_evt->header.evt_id)
    {
    	case BLE_GAP_EVT_ADV_REPORT: {
			ble_gap_evt_adv_report_t const * p_evt_adv_report = &p_ble_evt->evt.gap_evt.params.adv_report;
			if (0 != p_evt_adv_report->data.len)
				modMessagePostToMachine(gBLE->the, (uint8_t*)p_evt_adv_report, sizeof(ble_gap_evt_adv_report_t), gapAdvReportEvent, NULL);
   			break;
    	}
		case BLE_GAP_EVT_AUTH_KEY_REQUEST:
			modMessagePostToMachine(gBLE->the, (uint8_t*)&p_ble_evt->evt.gap_evt, sizeof(ble_gap_evt_t), gapAuthKeyRequestEvent, NULL);
			break;
		case BLE_GAP_EVT_CONNECTED:
			if (0xFF != gBLE->iocap)
				pm_handler_secure_on_connection(p_ble_evt);
			modMessagePostToMachine(gBLE->the, (uint8_t*)&p_ble_evt->evt.gap_evt, sizeof(ble_gap_evt_t), gapConnectedEvent, NULL);
			break;
		case BLE_GAP_EVT_DISCONNECTED:
			modMessagePostToMachine(gBLE->the, (uint8_t*)&p_ble_evt->evt.gap_evt, sizeof(ble_gap_evt_t), gapDisconnectedEvent, NULL);
			break;
        case BLE_GAP_EVT_PASSKEY_DISPLAY:
			modMessagePostToMachine(gBLE->the, (uint8_t*)&p_ble_evt->evt.gap_evt, sizeof(ble_gap_evt_t), gapPasskeyDisplayEvent, NULL);
        	break;
        case BLE_GAP_EVT_RSSI_CHANGED:
			modMessagePostToMachine(gBLE->the, (uint8_t*)&p_ble_evt->evt.gap_evt, sizeof(ble_gap_evt_t), gapRSSIChangedEvent, NULL);
			sd_ble_gap_rssi_stop(p_ble_evt->evt.gap_evt.conn_handle);       	
        	break;
		case BLE_GAP_EVT_DATA_LENGTH_UPDATE_REQUEST: {
			ble_gap_data_length_params_t dlp;
			dlp.max_rx_octets = BLE_GAP_DATA_LENGTH_AUTO;
			dlp.max_tx_octets = BLE_GAP_DATA_LENGTH_AUTO;
			dlp.max_rx_time_us = BLE_GAP_DATA_LENGTH_AUTO;
			dlp.max_tx_time_us = BLE_GAP_DATA_LENGTH_AUTO;
			sd_ble_gap_data_length_update(p_ble_evt->evt.gap_evt.conn_handle, &dlp, NULL);
			break;
		}
			
		case BLE_GATTC_EVT_CHAR_DISC_RSP: {
			gattDiscoveryRecord *gdr;
			ble_gattc_evt_char_disc_rsp_t const *char_disc_rsp = &p_ble_evt->evt.gattc_evt.params.char_disc_rsp;
			uint16_t len = sizeof(ble_gattc_evt_char_disc_rsp_t) + (char_disc_rsp->count * sizeof(ble_gattc_char_t));
			gdr = c_malloc(len);
			if (NULL != gdr) {
				gdr->conn_handle = p_ble_evt->evt.gattc_evt.conn_handle;
				gdr->gatt_status = p_ble_evt->evt.gattc_evt.gatt_status;	
				c_memmove(gdr->rsp, char_disc_rsp, len);
				
				modBLEConnection connection = modBLEConnectionFindByConnectionID(gdr->conn_handle);
				if (NULL != connection) {
					if (0 != connection->gattProcedure.discovery_handle)
						modMessagePostToMachine(gBLE->the, NULL, 0, gattcCharacteristicsForDescriptorsDiscoveryEvent, (void*)gdr);
					else
						modMessagePostToMachine(gBLE->the, NULL, 0, gattcCharacteristicDiscoveryEvent, (void*)gdr);
				}
			}
			break;
		}
		case BLE_GATTC_EVT_DESC_DISC_RSP: {
			gattDiscoveryRecord *gdr;
			ble_gattc_evt_desc_disc_rsp_t const *desc_disc_rsp = &p_ble_evt->evt.gattc_evt.params.desc_disc_rsp;
			uint16_t len = sizeof(ble_gattc_evt_desc_disc_rsp_t) + (desc_disc_rsp->count * sizeof(ble_gattc_desc_t));
			gdr = c_malloc(len);
			if (NULL != gdr) {
				gdr->conn_handle = p_ble_evt->evt.gattc_evt.conn_handle;
				gdr->gatt_status = p_ble_evt->evt.gattc_evt.gatt_status;	
				c_memmove(gdr->rsp, desc_disc_rsp, len);
				modMessagePostToMachine(gBLE->the, NULL, 0, gattcDescriptorDiscoveryEvent, (void*)gdr);
			}
			break;
		}
        case BLE_GATTC_EVT_EXCHANGE_MTU_RSP:
			if (BLE_GATT_STATUS_SUCCESS == p_ble_evt->evt.gattc_evt.gatt_status) {
				ble_gattc_evt_exchange_mtu_rsp_t const *mtu = &p_ble_evt->evt.gattc_evt.params.exchange_mtu_rsp;
				modMessagePostToMachine(gBLE->the, (uint8_t*)mtu, sizeof(ble_gattc_evt_exchange_mtu_rsp_t), gattcMTUExchangedEvent, (void*)(uint32_t)p_ble_evt->evt.gattc_evt.conn_handle);
			}
        	break;
        case BLE_GATTC_EVT_HVX:
			if (BLE_GATT_STATUS_SUCCESS == p_ble_evt->evt.gattc_evt.gatt_status) {
				ble_gattc_evt_hvx_t const *hvx = &p_ble_evt->evt.gattc_evt.params.hvx;
				modMessagePostToMachine(gBLE->the, (uint8_t*)hvx, sizeof(ble_gattc_evt_hvx_t) + hvx->len - 1, gattcCharacteristicNotificationEvent, (void*)(uint32_t)p_ble_evt->evt.gattc_evt.conn_handle);
			}
        	break;
		case BLE_GATTC_EVT_PRIM_SRVC_DISC_RSP: {
			gattDiscoveryRecord *gdr;
			ble_gattc_evt_prim_srvc_disc_rsp_t const *prim_srvc_disc_rsp = &p_ble_evt->evt.gattc_evt.params.prim_srvc_disc_rsp;
			uint16_t len = sizeof(ble_gattc_evt_prim_srvc_disc_rsp_t) + (prim_srvc_disc_rsp->count * sizeof(ble_gattc_service_t));
			gdr = c_malloc(len);
			if (NULL != gdr) {
				gdr->conn_handle = p_ble_evt->evt.gattc_evt.conn_handle;
				gdr->gatt_status = p_ble_evt->evt.gattc_evt.gatt_status;	
				c_memmove(gdr->rsp, prim_srvc_disc_rsp, len);
				modMessagePostToMachine(gBLE->the, NULL, 0, gattcServiceDiscoveryEvent, (void*)gdr);
			}
			break;
		}
        case BLE_GATTC_EVT_READ_RSP:
			if (BLE_GATT_STATUS_SUCCESS == p_ble_evt->evt.gattc_evt.gatt_status) {
				ble_gattc_evt_read_rsp_t const *read_rsp = &p_ble_evt->evt.gattc_evt.params.read_rsp;
				modMessagePostToMachine(gBLE->the, (uint8_t*)read_rsp, sizeof(ble_gattc_evt_read_rsp_t) + read_rsp->len - 1, gattcCharacteristicReadEvent, (void*)(uint32_t)p_ble_evt->evt.gattc_evt.conn_handle);
			}
        	break;
        case BLE_GATTC_EVT_WRITE_RSP:
			if (BLE_GATT_STATUS_SUCCESS == p_ble_evt->evt.gattc_evt.gatt_status) {
				ble_gattc_evt_write_rsp_t const *write_rsp = &p_ble_evt->evt.gattc_evt.params.write_rsp;
				modMessagePostToMachine(gBLE->the, (uint8_t*)write_rsp, sizeof(ble_gattc_evt_write_rsp_t) + write_rsp->len - 1, gattcCharacteristicWriteEvent, (void*)(uint32_t)p_ble_evt->evt.gattc_evt.conn_handle);
			}
        	break;
        	
        default:
            break;
    }
}

static void logPMEvent(uint16_t evt_id) {
	switch(evt_id) {
		case PM_EVT_BONDED_PEER_CONNECTED: modLog("PM_EVT_BONDED_PEER_CONNECTED"); break;
		case PM_EVT_CONN_SEC_START: modLog("PM_EVT_CONN_SEC_START"); break;
		case PM_EVT_CONN_SEC_SUCCEEDED: modLog("PM_EVT_CONN_SEC_SUCCEEDED"); break;
		case PM_EVT_CONN_SEC_FAILED: modLog("PM_EVT_CONN_SEC_FAILED"); break;
		case PM_EVT_CONN_SEC_CONFIG_REQ: modLog("PM_EVT_CONN_SEC_CONFIG_REQ"); break;
		case PM_EVT_CONN_SEC_PARAMS_REQ: modLog("PM_EVT_CONN_SEC_PARAMS_REQ"); break;
		case PM_EVT_STORAGE_FULL: modLog("PM_EVT_STORAGE_FULL"); break;
		case PM_EVT_ERROR_UNEXPECTED: modLog("PM_EVT_ERROR_UNEXPECTED"); break;
		case PM_EVT_PEER_DATA_UPDATE_SUCCEEDED: modLog("PM_EVT_PEER_DATA_UPDATE_SUCCEEDED"); break;
		case PM_EVT_PEER_DATA_UPDATE_FAILED: modLog("PM_EVT_PEER_DATA_UPDATE_FAILED"); break;
		case PM_EVT_PEER_DELETE_SUCCEEDED: modLog("PM_EVT_PEER_DELETE_SUCCEEDED"); break;
		case PM_EVT_PEERS_DELETE_FAILED: modLog("PM_EVT_PEERS_DELETE_FAILED"); break;
		case PM_EVT_LOCAL_DB_CACHE_APPLIED: modLog("PM_EVT_LOCAL_DB_CACHE_APPLIED"); break;
		case PM_EVT_LOCAL_DB_CACHE_APPLY_FAILED: modLog("PM_EVT_LOCAL_DB_CACHE_APPLY_FAILED"); break;
		case PM_EVT_SERVICE_CHANGED_IND_SENT: modLog("PM_EVT_SERVICE_CHANGED_IND_SENT"); break;
		case PM_EVT_SERVICE_CHANGED_IND_CONFIRMED: modLog("PM_EVT_SERVICE_CHANGED_IND_CONFIRMED"); break;
		case PM_EVT_SLAVE_SECURITY_REQ: modLog("PM_EVT_SLAVE_SECURITY_REQ"); break;
		case PM_EVT_FLASH_GARBAGE_COLLECTED: modLog("PM_EVT_FLASH_GARBAGE_COLLECTED"); break;
		case PM_EVT_FLASH_GARBAGE_COLLECTION_FAILED: modLog("PM_EVT_FLASH_GARBAGE_COLLECTION_FAILED"); break;
	}
}

void pm_evt_handler(pm_evt_t const * p_evt)
{
	LOG_PM_EVENT(p_evt->evt_id);
	
	pm_handler_on_pm_evt(p_evt);
	pm_handler_disconnect_on_sec_failure(p_evt);
	pm_handler_flash_clean(p_evt);

