Moddable-OpenSource/moddable/modules/network/ble/nrf52/modBLEClient.c
    switch (p_evt->evt_id) {
    	case PM_EVT_CONN_SEC_FAILED:
            // Rebond if one party has lost its keys
            if (p_evt->params.conn_sec_failed.error == PM_CONN_SEC_ERROR_PIN_OR_KEY_MISSING) {
				ret_code_t err_code;
                err_code = pm_conn_secure(p_evt->conn_handle, true);
            }
    		break;
		case PM_EVT_CONN_SEC_SUCCEEDED:
			modMessagePostToMachine(gBLE->the, (uint8_t*)p_evt, sizeof(pm_evt_t), pmConnSecSucceededEvent, NULL);
			break;    		
        default:
            break;
    }
}

static void logScanEvent(uint16_t evt_id) {
	switch(evt_id) {
		case NRF_BLE_SCAN_EVT_FILTER_MATCH: modLog("NRF_BLE_SCAN_EVT_FILTER_MATCH"); break;
		case NRF_BLE_SCAN_EVT_WHITELIST_REQUEST: modLog("NRF_BLE_SCAN_EVT_WHITELIST_REQUEST"); break;
		case NRF_BLE_SCAN_EVT_WHITELIST_ADV_REPORT: modLog("NRF_BLE_SCAN_EVT_WHITELIST_ADV_REPORT"); break;
		case NRF_BLE_SCAN_EVT_NOT_FOUND: modLog("NRF_BLE_SCAN_EVT_NOT_FOUND"); break;
		case NRF_BLE_SCAN_EVT_SCAN_TIMEOUT: modLog("NRF_BLE_SCAN_EVT_SCAN_TIMEOUT"); break;
		case NRF_BLE_SCAN_EVT_SCAN_REQ_REPORT: modLog("NRF_BLE_SCAN_EVT_SCAN_REQ_REPORT"); break;
		case NRF_BLE_SCAN_EVT_CONNECTING_ERROR: modLog("NRF_BLE_SCAN_EVT_CONNECTING_ERROR"); break;
		case NRF_BLE_SCAN_EVT_CONNECTED: modLog("NRF_BLE_SCAN_EVT_CONNECTED"); break;
	}
}

// This scan_evt_handler() function seems to be required to support the whitelist, even though it is empty.
static void scan_evt_handler(scan_evt_t const * p_scan_evt)
{
	LOG_SCAN_EVENT(p_scan_evt->scan_evt_id);

    switch(p_scan_evt->scan_evt_id) {
        case NRF_BLE_SCAN_EVT_WHITELIST_REQUEST:
        	break;
        case NRF_BLE_SCAN_EVT_CONNECTING_ERROR:
        	break;
        case NRF_BLE_SCAN_EVT_SCAN_TIMEOUT:
        	break;
        case NRF_BLE_SCAN_EVT_FILTER_MATCH:
            break;
        case NRF_BLE_SCAN_EVT_WHITELIST_ADV_REPORT:
            break;
        default:
			break;
    }
}
